import React, { useState } from 'react';
import './gb.scss';

export default function Gyeongbuk () {

    const [isHovered, setIsHovered] = useState(false);

    const handleMouseEnter = () => {
        setIsHovered(true);
		document.querySelectorAll('.paw_gb').forEach((paw_gb) => {
            paw_gb.classList.remove('disappear'); // 발자국에 disappear 클래스 제거
        });
    };

    const handleMouseLeave = () => {
        setIsHovered(false);
        document.querySelectorAll('.paw_gb').forEach((paw_gb) => {
            paw_gb.classList.add('disappear'); // 발자국에 disappear 클래스 추가
        });
    };

    return (
        <>
            <svg id="svg-sprite">
                <symbol id="paw_gb" viewBox="0 0 249 209.32">
                    <image href='/오리.png' x="0" y="0" height="150px" width="150px" />
                </symbol>
            </svg>
            <path
            id='gyeongbuk'
            className={`area_gb ${isHovered ? 'hovered' : ''}`} onMouseEnter={handleMouseEnter} onMouseLeave={handleMouseLeave}
            d="M 517.52 415.95 517.11 424.88 508.83 440.7 511.06 449.83 501.61 488.32 499.37 491.29 484.62 486.28 475.99 492.92 470.58 483.91 461.89 478.87 446.12 481.96 437.92 492.49 428.23 500.45 417.83 494.64 408.63 502.89 394.05 508.64 378.73 503.18 369.86 506.51 355.43 495.61 333.87 500.71 324.85 492.91 308.88 495.23 306.91 475.04 298.72 468.91 296.88 462.34 288.61 458.44 279.79 460.78 261.68 449.99 263.14 439.98 255.45 421.52 271.82 415.68 276.01 404.01 273.91 393.72 279.11 389.65 272.76 382.02 253.56 371.28 259.74 364.2 256.86 353.53 261.68 329.55 257.73 324.33 246.88 319.27 254.29 312.05 266.89 312.15 266.46 299.65 270.64 291.28 281.97 288.98 286 276.02 291.03 278.59 299.8 274.72 309.55 276.67 313.32 265.44 325.28 275.95 340.26 276.58 344.49 269.75 340.67 264.42 343.23 254.89 364.08 233.1 370.71 226.95 381.81 233.23 389.67 230.72 392.67 224.36 403.74 230.92 413.23 228.06 415.09 223.18 436.28 227.34 440.9 221.21 455.92 232.14 467.13 217.76 475.34 212.64 479.64 215.55 482.81 220.09 487.49 227.05 488.19 234.78 490.65 264.95 499.35 282.77 499.41 295.16 490.73 306.89 489.79 315.17 494.5 322.78 495.7 331.92 493.46 349.58 486.14 364.06 485.7 379.52 489.25 399.96 495.02 405.39 504.51 405.34 511.49 413.39 517.52 415.95 Z"/>
        </>
    );
};

